pfm/tutorials/POD/moldFlow/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    frontAndBack
    {
        type            noSlip;
    }
    leftWall
    {
        type            noSlip;
    }
    rightWall
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    inlet
    {
        type            turbulentInlet;
        referenceField  uniform (1 0 0);
        fluctuationScale (0.1 0.1 0.1);
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
