pfm/tutorials/POD/moldFlow/system/PODsolverDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      PODsolverDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type       POD;

//solver     RK;
solver     Euler;

eps        0.0001;

scalarTransportCoeffs
{
    field      U;
    accuracy   0.9;

    velocity   U;
}


// ************************************************************************* //
