pfm/tutorials/POD/moldFlow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          topoSetDict;
}    


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

   {
        name    leftWallFaces;
        type    faceSet;
        action  new;
    	source	patchToFace;
    	sourceInfo
    	{
        	name "leftWall";      // Name of patch or patch group,
                            // (regular expressions allowed)
    	}
   }

   {
        name    leftWallCells;
        type    cellSet;
        action  new;
        source	faceToCell;
        sourceInfo
        {
                set	leftWallFaces;
		option	any;
        }
   }

   {
        name    leftWallCells;
        type    cellSet;
        action  subset;
        source  cylinderToCell;
        sourceInfo
	{
		p1       (0.0 0.31 0.035); // start point on cylinder axis
		p2       (0.01 0.31 0.035);   // end point on cylinder axis
		radius   0.0095;
        }

   }

   {
        name    inletFaceSet;
        type    faceSet;
        action  new;
        source	cellToFace;
        sourceInfo
        {
		set     leftWallCells;
		option  all;
        }
   }

   {
        name    inletFaceSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
 		box	(0.0 0.3 0.02) (0.0001 0.32 0.05); 
        }
   }

   {
        name    inletFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet inletFaceSet;
        }

   }
);

// ************************************************************************* //

